Use Case: Retrieve security event logs from Windows Event Viewer for events with ID 1102, indicating the clearing of security logs, over the past 7 days.

Query:

WindowsEvent('Security', 7d)
| where tostring(EventId) == '1102'