Use Case: Identifying failed login attempts on Windows systems within the last 7 days for security analysis and breach detection.

Query:

WindowsEvent('Security', 7d)
| where tostring(EventId) == '4625'